IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM9_CONTROLSS_G0_EPWM9.xml
	<register id="CONTROLSS_G0_EPWM9_GLDCFG" acronym="CONTROLSS_G0_EPWM9_GLDCFG" offset="0x6A" width="16" description="Global PWM Load Config Register ">
		<bitfield id="AQCSFRC" width="1" begin="10" end="10" resetval="0x0" description="Global load event configuration for AQCSFRC   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="10" rwaccess="R/W"/> 
		<bitfield id="AQCTLB_AQCTLB2" width="1" begin="9" end="9" resetval="0x0" description="Global load event configuration for AQCTLB_AQCTLB2   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="9" rwaccess="R/W"/> 
		<bitfield id="AQCTLA_AQCTLA2" width="1" begin="8" end="8" resetval="0x0" description="Global load event configuration for AQCTLA_AQCTLA2   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="8" rwaccess="R/W"/> 
		<bitfield id="DBCTL" width="1" begin="7" end="7" resetval="0x0" description="Global load event configuration for DBCTL   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="7" rwaccess="R/W"/> 
		<bitfield id="DBFED_DBFEDHR" width="1" begin="6" end="6" resetval="0x0" description="Global load event configuration for DBFED_DBFEDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="6" rwaccess="R/W"/> 
		<bitfield id="DBRED_DBREDHR" width="1" begin="5" end="5" resetval="0x0" description="Global load event configuration for DBRED_DBREDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="5" rwaccess="R/W"/> 
		<bitfield id="CMPD" width="1" begin="4" end="4" resetval="0x0" description="Global load event configuration for CMPD   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="4" rwaccess="R/W"/> 
		<bitfield id="CMPC" width="1" begin="3" end="3" resetval="0x0" description="Global load event configuration for CMPC   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="3" rwaccess="R/W"/> 
		<bitfield id="CMPB_CMPBHR" width="1" begin="2" end="2" resetval="0x0" description="Global load event configuration for CMPB_CMPBHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="2" rwaccess="R/W"/> 
		<bitfield id="CMPA_CMPAHR" width="1" begin="1" end="1" resetval="0x0" description="Global load event configuration for CMPA_CMPAHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="1" rwaccess="R/W"/> 
		<bitfield id="TBPRD_TBPRDHR" width="1" begin="0" end="0" resetval="0x0" description="Global load event configuration for TBPRD_TBPRDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM9_EPWMXLINK" acronym="CONTROLSS_G0_EPWM9_EPWMXLINK" offset="0x70" width="32" description="EPWMx Link Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="GLDCTL2LINK" width="5" begin="30" end="26" resetval="0x0" description="GLDCTL2 Link Bits  Writes to the GLDCTL2 registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's GLDCTL2 registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="30 - 26" rwaccess="R/W"/> 
		<bitfield id="CMPDLINK" width="5" begin="25" end="21" resetval="0x0" description="CMPD Link Bits  Writes to the CMPD registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPD registers.    00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="25 - 21" rwaccess="R/W"/> 
		<bitfield id="CMPCLINK" width="5" begin="20" end="16" resetval="0x0" description="CMPC Link Bits  Writes to the CMPC registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPC registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CMPBLINK" width="5" begin="14" end="10" resetval="0x0" description="CMPB_CMPBHR Link Bits  Writes to the CMPB_CMPBHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPB_CMPBHR registers.     00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="14 - 10" rwaccess="R/W"/> 
		<bitfield id="CMPALINK" width="5" begin="9" end="5" resetval="0x0" description="CMPA_CMPAHR Link Bits  Writes to the CMPA_CMPAHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPA_CMPAHR registers.     00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="TBPRDLINK" width="5" begin="4" end="0" resetval="0x0" description="TBPRD_TBPRDHR Link Bits  Writes to the TBPRD:TBPRDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's TBPRD_TBPRDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM9_EPWMXLINK2" acronym="CONTROLSS_G0_EPWM9_EPWMXLINK2" offset="0x74" width="32" description="EPWMx Link 2 Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="DBFEDLINK" width="5" begin="9" end="5" resetval="0x0" description="DBFED_DBFEDHR Link Bits  Writes to the DBFED:DBFEDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBFED_DBFEDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="DBREDLINK" width="5" begin="4" end="0" resetval="0x0" description="DBRED_DBREDHR Link Bits  Writes to the DBRED:DBREDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBRED_DBREDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM9_ETEST" acronym="CONTROLSS_G0_EPWM9_ETEST" offset="0x7A" width="16" description="EPWM Test Register">
		<bitfield id="CMPFIX_OVERRIDE" width="1" begin="0" end="0" resetval="0x1" description="0: Bug fix overriden 1: Bug fix takes effect" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM9_EPWMREV" acronym="CONTROLSS_G0_EPWM9_EPWMREV" offset="0x7C" width="16" description="EPWM Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x5" description="EPWM Type Bits: These bits specify the EPWM type. These bits are changed if the functionality of the EPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="EPWM Silicon Revision Bits: These bits specify the EPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G0_EPWM9_HRPWMREV" acronym="CONTROLSS_G0_EPWM9_HRPWMREV" offset="0x7E" width="16" description="High Resolution Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x3" description="HRPWM Type Bits: These bits specify the HRPWM type. These bits are changed if the functionality of the HRPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="HRPWM Silicon Revision Bits: These bits specify the HRPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
